# Assigning Subsets of Data

In previous chapters, we learned how to select subsets of data and create new columns with the assignment statement. In this chapter, we assign subsets of data with new data. Let's begin by reading in our sample DataFrame.

In [1]:
import pandas as pd
df = pd.read_csv('../data/sample_data.csv', index_col=0)
df

          state  color    food  age  height  score
name
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70    8.3
Aaron        FL    red   Mango   12     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

## Setting new data with `loc`

The `loc` indexer simultaneously selects rows and columns from a DataFrame using labels. We covered this in great detail in previous chapters. Let's review this by selecting the age of `Niko`, `Aaron`, and `Dean` as a Series.

In [2]:
rows = ['Niko', 'Aaron', 'Dean']
df.loc[rows, 'age']

name
Niko      2
Aaron    12
Dean     32
Name: age, dtype: int64

We can assign these new values with a list or an array of the same length or a single scalar value. Let's use the assignment statement to assign new values.

In [3]:
df.loc[rows, 'age'] = [4, 13, 34]

Let's verify that the assignment happened correctly.

In [4]:
df

          state  color    food  age  height  score
name
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    4      70    8.3
Aaron        FL    red   Mango   13     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   34     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

You can even use one of the augmented assignment operators (`+=`, `-=`, etc...) to operate on the selection itself. Here, we increase the age of these three values by 2.

In [5]:
df.loc[rows, 'age'] += 2
df

          state  color    food  age  height  score
name
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    6      70    8.3
Aaron        FL    red   Mango   15     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   36     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

### Set new row values

It's possible to modify values from a single row with `loc`. Here, we change the food and height column values for the row labeled with 'Niko'.

In [6]:
cols = ['food', 'height']
df.loc['Niko', cols] = ['PIZZA', 82]
df

          state  color    food  age  height  score
name
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green   PIZZA    6      82    8.3
Aaron        FL    red   Mango   15     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   36     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

## Setting new data with iloc

Setting new data with the `iloc` indexer works analogously. We begin by setting a single cell of data. This changes the first row and last column of data.

In [7]:
df.iloc[0, -1] = 99.9
df

          state  color    food  age  height  score
name
Jane         NY   blue   Steak   30     165   99.9
Niko         TX  green   PIZZA    6      82    8.3
Aaron        FL    red   Mango   15     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   36     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

The `iloc` indexer can take a single integer, a list of integers, or a slice. Below, we slice the rows and use a single integer for the columns.

In [8]:
df.iloc[3:, 4] = [155, 205, 195, 165]
df

          state  color    food  age  height  score
name
Jane         NY   blue   Steak   30     165   99.9
Niko         TX  green   PIZZA    6      82    8.3
Aaron        FL    red   Mango   15     120    9.0
Penelope     AL  white   Apple    4     155    3.3
Dean         AK   gray  Cheese   36     205    1.8
Christina    TX  black   Melon   33     195    9.5
Cornelia     TX    red   Beans   69     165    2.2

## Boolean selection assignment

Typically, you will not be manually setting rows and columns as shown above. A more common task is to select a portion of the DataFrame with boolean selection and assign that selection new values. Let's see some examples with the employee dataset.

In [9]:
emp = pd.read_csv('../data/employee.csv')
emp.head(3)

,dept,title,hire_date,salary,sex,race
0,Police,POLICE SERGEANT,2001-12-03,87545.38,Male,White
1,Other,ASSISTANT CITY ATTORNEY II,2010-11-15,82182.00,Male,Hispanic
2,Houston Public Works,SENIOR SLUDGE PROCESSOR,2006-01-09,49275.00,Male,Black

Let's say we wanted to raise the minimum salary for all police department employees to 60000. Before making the assignment let's find the number of police department employees currently making less than this.

In [10]:
filt1 = emp['salary'] < 60000
filt2 = emp['dept'] == 'Police'
filt = filt1 & filt2
filt.sum()

2190

Use the `loc` indexer to select just the employees that meet the conditions for the above filter and reassign their salary.

In [11]:
emp.loc[filt, 'salary'] = 60000

Let's use our same filter to select those employees and verify that their salary has now changed.

In [12]:
emp[filt].head(3)

      dept                      title   hire_date   salary     sex      race
38  Police             POLICE OFFICER  2017-07-17  60000.0    Male     White
54  Police             POLICE TRAINEE  2018-09-04  60000.0    Male     Asian
59  Police  ADMINISTRATIVE SPECIALIST  1998-12-11  60000.0  Female  Hispanic

## Improper Assignment

The above assignment is often done improperly and in a way that has no effect. Let's reread in the dataset as a new variable name `emp2` and recreate our filters.

In [13]:
emp2 = pd.read_csv('../data/employee.csv')
filt1 = emp2['salary'] < 60000
filt2 = emp2['dept'] == 'Police'
filt = filt1 & filt2
emp2[filt].head(3)

      dept                      title   hire_date    salary     sex      race
38  Police             POLICE OFFICER  2017-07-17  56956.64    Male     White
54  Police             POLICE TRAINEE  2018-09-04  42000.00    Male     Asian
59  Police  ADMINISTRATIVE SPECIALIST  1998-12-11  51407.00  Female  Hispanic

The last expression from above returns a DataFrame object which we can use *just the brackets* again to select the `salary` column.

In [14]:
emp2[filt]['salary'].head(3)

38    56956.64
54    42000.00
59    51407.00
Name: salary, dtype: float64

If we try to use an assignment statement with the above syntax, no change will take place and a `SettingWithCopyWarning` will be emitted. Let's attempt the assignment and trigger the warning. Note that this is a warning and not an error. The statement completed successfully.

In [15]:
emp2[filt]['salary'] = 60000

/Users/Ted/miniconda3/envs/minimal_ds/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

Selecting those employees that we were hoping to change salary exposes the improper assignment.

In [16]:
emp2[filt].head(3)

      dept                      title   hire_date    salary     sex      race
38  Police             POLICE OFFICER  2017-07-17  56956.64    Male     White
54  Police             POLICE TRAINEE  2018-09-04  42000.00    Male     Asian
59  Police  ADMINISTRATIVE SPECIALIST  1998-12-11  51407.00  Female  Hispanic

### What went wrong?

Executing `emp2[filt]['salary']` is referred to as **chained indexing** in the pandas documentation or with the terminology in this book **chained selections**. There were two consecutive selections. The first was boolean selection with `[filt]` followed immediately by single-column selection with `['salary']`. 

The issue is that the first selection, `emp2[filt]`, creates a completely new DataFrame with its own copy of data in memory that has nothing to do with the original DataFrrame. From this new DataFrame, we select the `salary` column and attempt to reassign each value. What we have done is set the salary for this copy of the data. pandas is nice-enough to give us a warning that we might not have accomplished what we thought we did. In this example, the warning proved to be correct and our original DataFrame was not modified. In order to properly assign a subset of data using boolean selection along a column, you need to use `loc` which is a single selection (one set of brackets) that doesn't involve making a copy of the data.

The `SettingWithCopyWarning` requires a deeper discussion to fully understand which will be presented in a later chapter.

## Exercises

Use the bikes dataset for all of the following exercises.

In [17]:
bikes = pd.read_csv('../data/bikes.csv')

### Exercise 1
<span  style="color:green; font-size:16px">Change the values of `events` to 'HEAT WAVE' for all rides where `temperature` is above 95. Verify this by outputting just the `events` and `temperature` columns that meet the condition.</span>

### Exercise 2
<span  style="color:green; font-size:16px">Increase the trip duration by 50% for all the rides that took place with a wind speed above 40. Output just the trip duration and wind speed before and after the assignment.</span>

### Exercise 3
<span  style="color:green; font-size:16px">Change the trip duration for the first two rows to 0.</span>